# GetCurrentElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CodeCheckingParameterServiceData..::..GetCurrentElements Method
CodeCheckingParameterServiceData Class See Also
---
Returns the list of Ids of the current elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ElementId> GetCurrentElements()
```

Visual Basic
---
```text
Public Function GetCurrentElements As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetCurrentElements()
```

# ### Return Value
Ids of the current elements. Contains the analytical model element to which the code checking parameter belongs.
# See Also
CodeCheckingParameterServiceData Class
Autodesk.Revit.DB.Structure Namespace